<template>
  <section class="ordering">
    <div class="container">
      <div class="ordering__wrapper">
        <section class="ordering__info">
          <header>
            <h1>Оформлення замовлення</h1>
          </header>
          <div class="ordering__content">
            <div class="ordering__list">
              <div class="ordering__title">
                <input type="checkbox" id="list-1" />
                <label for="list-1">1. Контактна інформація</label>
              </div>
              <form class="ordering__dropdown">
                <ul class="ordering__social-networks">
                  <li>
                    <a href="#"
                      ><svg
                        width="29"
                        height="29"
                        viewBox="0 0 29 29"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                          d="M1.53516 8.07047C2.45319 6.20083 3.75029 4.6206 5.38499 3.30665C7.60012 1.51804 10.141 0.441405 12.9899 0.111469C16.3363 -0.276352 19.4813 0.343003 22.3894 2.04478C23.112 2.46733 23.7872 2.94777 24.4328 3.46872C24.5927 3.59606 24.5749 3.67131 24.4387 3.79866C23.1179 5.08367 21.7971 6.36869 20.4882 7.66528C20.3342 7.81578 20.2513 7.8042 20.0854 7.68265C16.2474 4.79426 10.6504 5.57568 7.78965 9.396C7.28621 10.0675 6.87754 10.791 6.59324 11.5782C6.56955 11.6477 6.52217 11.7114 6.48663 11.7808C5.72259 11.2136 4.95262 10.6463 4.1945 10.0732C3.30608 9.40758 2.41766 8.74192 1.53516 8.07047Z"
                          fill="#E84A5F" />
                        <path
                          d="M6.4867 17.2101C6.74138 17.76 6.9546 18.3331 7.27443 18.8483C8.61891 21.0015 10.5379 22.3849 13.0669 22.877C15.3472 23.3227 17.5387 23.0217 19.5821 21.9045C19.6531 21.8698 19.7242 21.835 19.7894 21.8003C19.8249 21.835 19.8545 21.8756 19.89 21.9045C21.4181 23.0622 22.9521 24.2199 24.4802 25.3775C23.7458 26.0895 22.9107 26.6625 22.0223 27.1603C19.4458 28.5959 16.6562 29.1747 13.7185 28.9547C10.0582 28.6769 6.90129 27.2645 4.29525 24.7177C3.15215 23.6005 2.21042 22.3386 1.5293 20.8973C2.16304 20.4227 2.79678 19.9538 3.43052 19.4792C4.44925 18.7209 5.46797 17.9684 6.4867 17.2101Z"
                          fill="#E84A5F" />
                        <path
                          d="M24.4866 25.3775C22.9585 24.2198 21.4245 23.0621 19.8964 21.9045C19.8609 21.8755 19.8254 21.835 19.7957 21.8003C20.3229 21.4009 20.8619 21.0131 21.2942 20.5037C22.0168 19.6586 22.4966 18.7035 22.7453 17.6327C22.7749 17.4995 22.7512 17.4532 22.615 17.459C22.5439 17.4648 22.4788 17.459 22.4077 17.459C19.9912 17.459 17.5688 17.4532 15.1523 17.4648C14.8857 17.4648 14.8265 17.3953 14.8324 17.1464C14.8443 15.4678 14.8443 13.7892 14.8324 12.1106C14.8324 11.8964 14.8917 11.8385 15.1108 11.8385C19.5411 11.8443 23.9713 11.8443 28.4075 11.8385C28.5971 11.8385 28.6741 11.8848 28.7214 12.0816C29.0827 13.6734 29.059 15.271 28.8399 16.8802C28.6622 18.1652 28.3424 19.4097 27.8508 20.6137C27.1223 22.3907 26.0502 23.942 24.6406 25.2733C24.5873 25.3138 24.534 25.3428 24.4866 25.3775Z"
                          fill="#E84A5F" />
                        <path
                          d="M6.48683 17.2103C5.4681 17.9685 4.44938 18.721 3.43065 19.4793C2.79691 19.9482 2.16317 20.4228 1.52943 20.8975C1.03784 20.0061 0.718003 19.0625 0.457399 18.0901C-0.0401175 16.2089 -0.117114 14.2987 0.155335 12.3828C0.368557 10.8778 0.812768 9.43071 1.52943 8.07623C2.41785 8.74189 3.30035 9.41335 4.18878 10.079C4.95282 10.6521 5.71686 11.2193 6.48091 11.7866C6.3506 12.4059 6.167 13.0137 6.10777 13.6504C6.00116 14.8081 6.11369 15.9368 6.45129 17.0482C6.47498 17.0945 6.48091 17.1524 6.48683 17.2103Z"
                          fill="#E84A5F" /></svg
                    ></a>
                  </li>
                  <li>
                    <a href="#"
                      ><svg
                        width="29"
                        height="29"
                        viewBox="0 0 29 29"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                          d="M14.5 29C22.5081 29 29 22.5081 29 14.5C29 6.49187 22.5081 0 14.5 0C6.49187 0 0 6.49187 0 14.5C0 22.5081 6.49187 29 14.5 29Z"
                          fill="#E84A5F" />
                        <path
                          d="M18.1452 15.0674H15.5579V24.5462H11.6378V15.0674H9.77344V11.7362H11.6378V9.58046C11.6378 8.03891 12.3701 5.625 15.5928 5.625L18.4965 5.63715V8.87069H16.3897C16.0441 8.87069 15.5581 9.04335 15.5581 9.77871V11.7393H18.4877L18.1452 15.0674Z"
                          fill="#FFFFFF" /></svg
                    ></a>
                  </li>
                </ul>
                <div>
                  <label for="name">Ім'я</label>
                  <input id="name" name="name" type="text" />
                </div>
                <div>
                  <label for="surname">Прізвище</label>
                  <input id="surname" name="surname" type="text" />
                </div>
                <div>
                  <label for="phone">Номер телефону</label>
                  <input
                    class="tel"
                    name="phone"
                    id="phone"
                    type="tel"
                    placeholder="+38 (0ХХ) ХХХ-ХХ-ХХ" />
                </div>
                <div>
                  <label for="surname">Email</label>
                  <input id="email" name="email" type="text" />
                </div>
                <button class="button button-fill">Далі</button>
              </form>
            </div>
            <div class="ordering__list open">
              <div class="ordering__title">
                <input type="checkbox" id="list-1" />
                <label for="list-1">2. Деталі доставки</label>
              </div>
              <form class="ordering__dropdown">
                <div class="ordering__radios">
                  <p>Доставка:</p>
                  <div class="ordering__radios-wrapper">
                    <div class="radio">
                      <input
                        type="radio"
                        name="delivery"
                        id="self-pickup"
                        checked />
                      <label for="self-pickup">
                        <p>Самовивіз з Нової пошти: <strong>50₴</strong></p>
                        <span>Буде передано в службу доставки завтра</span>
                      </label>
                    </div>
                    <div class="radio">
                      <input
                        type="radio"
                        name="delivery"
                        id="address-delivery" />
                      <label for="address-delivery">
                        <p>
                          Адресна доставка Новою Поштою: <strong>75₴</strong>
                        </p>
                        <span>Буде передано в службу доставки завтра</span>
                      </label>
                    </div>
                    <div class="radio">
                      <input type="radio" name="delivery" id="post-office" />
                      <label for="post-office">
                        <p>Поштомат Нової Пошти: <strong>50₴</strong></p>
                        <span>Буде передано в службу доставки завтра</span>
                      </label>
                    </div>
                    <div class="radio">
                      <input type="radio" name="delivery" id="showroom" />
                      <label for="showroom">
                        <p>
                          Самовивіз з шоуруму (Київ):
                          <strong>безкоштовно</strong>
                        </p>
                        <span>Буде передано в службу доставки завтра</span>
                      </label>
                    </div>
                  </div>
                  <div class="ordering__selects"></div>
                </div>
                <button class="button button-fill">Далі</button>
              </form>
            </div>
          </div>
        </section>
        <aside class="ordering__cart">
          <header class="ordering__header">
            <h1></h1>
          </header>
          <div class="ordering__body">
            <div class="ordering__wrapper">
              <article class="product">
                <header class="product__picture">
                  <img src="../assets/img/cart-product.png" alt="test" />
                </header>
                <section class="product__content">
                  <header>
                    <h2>Бюстгальтер “Timbaland”</h2>
                    <div class="product__option">
                      <svg
                        width="3"
                        height="17"
                        viewBox="0 0 3 17"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <circle cx="1.5" cy="1.5" r="1.5" fill="black" />
                        <circle cx="1.5" cy="8.5" r="1.5" fill="black" />
                        <circle cx="1.5" cy="15.5" r="1.5" fill="black" />
                      </svg>
                      <ul>
                        <li>
                          <button type="button">
                            <svg
                              width="22"
                              height="25"
                              viewBox="0 0 22 25"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg">
                              <path
                                d="M15.0097 9.61133L14.0934 20.4087C14.0525 20.8921 14.7862 20.9581 14.8276 20.4703L15.7439 9.6729C15.761 9.47138 15.6105 9.29424 15.4078 9.27719C15.2048 9.2602 15.0268 9.40976 15.0097 9.61133Z"
                                fill="#FAF1F1" />
                              <path
                                d="M6.59132 9.27718C6.38862 9.29422 6.23818 9.47137 6.25522 9.67288L7.17152 20.4702C7.21297 20.9587 7.94661 20.8921 7.90565 20.4087L6.98935 9.61131C6.97231 9.40975 6.79397 9.26029 6.59132 9.27718Z"
                                fill="#FAF1F1" />
                              <path
                                d="M10.6328 9.64209V20.4395C10.6328 20.6417 10.7977 20.8057 11.0012 20.8057C11.2047 20.8057 11.3695 20.6417 11.3695 20.4395V9.64209C11.3695 9.43984 11.2047 9.27588 11.0012 9.27588C10.7977 9.27588 10.6328 9.43984 10.6328 9.64209Z"
                                fill="#FAF1F1" />
                              <path
                                d="M20.3008 2.82871H14.5082V1.54155C14.5082 0.691553 13.8126 0 12.9576 0H9.04234C8.18734 0 7.49171 0.691553 7.49171 1.54155V2.82871H1.6991C0.762222 2.82871 0 3.58647 0 4.51787C0 5.44927 0.762222 6.20703 1.6991 6.20703H2.09531L3.47339 22.4455C3.59588 23.8887 4.80972 25 6.26884 25H15.7311C17.188 25 18.4039 23.891 18.5266 22.4455L18.7176 20.1942C18.7347 19.9927 18.5842 19.8155 18.3815 19.7985C18.1783 19.7812 18.0006 19.9311 17.9835 20.1326L17.7924 22.3839C17.7028 23.4402 16.7974 24.2676 15.7311 24.2676H6.26884C5.20259 24.2676 4.29715 23.4402 4.20752 22.3839L2.83464 6.20703H3.9253C4.12878 6.20703 4.29366 6.04307 4.29366 5.84082C4.29366 5.63857 4.12878 5.47461 3.9253 5.47461C3.11838 5.47461 2.16687 5.47461 1.6991 5.47461C1.16845 5.47461 0.73673 5.04541 0.73673 4.51787C0.73673 3.99033 1.16845 3.56113 1.6991 3.56113H20.3008C20.8315 3.56113 21.2632 3.99033 21.2632 4.51787C21.2632 5.04541 20.8315 5.47461 20.3008 5.47461C19.7287 5.47461 6.88558 5.47461 5.64841 5.47461C5.44493 5.47461 5.28005 5.63857 5.28005 5.84082C5.28005 6.04307 5.44493 6.20703 5.64841 6.20703H19.1653L18.1285 18.4241C18.1114 18.6256 18.2619 18.8027 18.4646 18.8198C18.4751 18.8207 18.4856 18.8211 18.496 18.8211C18.6854 18.8211 18.8464 18.6767 18.8627 18.4856L19.9047 6.20703H20.3009C21.2377 6.20703 22 5.44927 22 4.51787C22 3.58647 21.2377 2.82871 20.3008 2.82871ZM13.7715 2.82871H8.22844V1.54155C8.22844 1.09541 8.59357 0.732422 9.04234 0.732422H12.9576C13.4064 0.732422 13.7715 1.09541 13.7715 1.54155V2.82871H13.7715Z"
                                fill="#FAF1F1" /></svg
                            ><span>Видалити</span>
                          </button>
                        </li>
                        <li>
                          <button type="button">
                            <svg
                              width="24"
                              height="22"
                              viewBox="0 0 28 26"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg">
                              <path
                                d="M20.3 0C17.7917 0.00392404 15.4419 1.24323 14 3.32228C12.5581 1.24323 10.2083 0.00392404 7.7 0C3.59798 0 0 3.8661 0 8.2728C0 12.5675 2.39395 16.9909 6.92344 21.0649C9.02207 22.9489 11.3242 24.5867 13.7858 25.9474C13.9202 26.0175 14.0798 26.0175 14.2142 25.9474C16.6749 24.5867 18.9763 22.9487 21.0743 21.0649C25.6061 16.9909 28 12.5675 28 8.2728C28 3.8661 24.402 0 20.3 0V0ZM14 24.9899C12.286 24.0317 0.933333 17.3378 0.933333 8.2728C0.933333 4.36953 4.09495 0.945463 7.7 0.945463C10.1423 0.949849 12.3936 2.28448 13.5935 4.43947C13.6833 4.57843 13.8362 4.66199 14 4.66199C14.1638 4.66199 14.3167 4.57843 14.4065 4.43947C15.6064 2.28448 17.8577 0.949849 20.3 0.945463C23.905 0.945463 27.0667 4.36953 27.0667 8.2728C27.0667 17.3378 15.714 24.0317 14 24.9899Z"
                                fill="#FAF1F1" /></svg
                            ><span>У список бажань</span>
                          </button>
                        </li>
                      </ul>
                    </div>
                  </header>
                  <div class="product__settings">
                    <!-- <div>
                      <p>Колір:</p>
                      <SelectColor :variants="variants" />
                    </div> -->
                    <div>
                      <p>Розмір:</p>
                      <div class="product__select">
                        <select name="size" id="size">
                          <option value="1">70A</option>
                          <option value="2">70B</option>
                          <option value="3">70C</option>
                          <option value="4">70D</option>
                        </select>
                      </div>
                    </div>
                  </div>
                  <footer>
                    <div class="product__count">
                      <button type="button">-</button>
                      <span>0</span>
                      <button type="button">+</button>
                    </div>
                    <span class="product__price"> 1500 ₴ </span>
                  </footer>
                </section>
              </article>
            </div>
          </div>
        </aside>
      </div>
    </div>
  </section>
</template>
