<template>
  <section class="wholesale">
    <div class="container">
      <div class="wholesale__info-block">
        <h1>Оптові закупівлі</h1>
        <p>
          Опт - закупівля від 10 одиниць товару одним замовленням. Знижка при
          оптовій закупівлі складає 20% від вартості товару.
        </p>
        <p>Розміри та кольори товару можуть бути різними.</p>
        <p>
          Знижка розрахується автоматично після додавання в корзину 10 однакових
          товарів.
        </p>
      </div>
    </div>
  </section>
</template>
